[Killed] Equality mutation
main/Core/Commons/ArgumentChecker.cs:14:92
 {
     public static bool IsPercentage(string input)
     {
-        return string.IsNullOrEmpty(input) || byte.TryParse(input, out byte percentage) && percentage <= 100;
+        return string.IsNullOrEmpty(input) || byte.TryParse(input, out byte percentage) && percentage < 100;
     }
     
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage

[Killed] Equality mutation
main/Core/Commons/ArgumentChecker.cs:14:92
 {
     public static bool IsPercentage(string input)
     {
-        return string.IsNullOrEmpty(input) || byte.TryParse(input, out byte percentage) && percentage <= 100;
+        return string.IsNullOrEmpty(input) || byte.TryParse(input, out byte percentage) && percentage > 100;
     }
     
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsPercentage

[Killed] String mutation
main/Core/Commons/ArgumentChecker.cs:24:16
     
     public static bool IsInteger(string input)
     {
-        return string.IsNullOrEmpty(input) || int.TryParse(input, out _);
+        return (input!=null) || int.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsInteger; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsInteger; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsInteger

[Killed] String mutation
main/Core/Commons/ArgumentChecker.cs:29:16
 
     public static bool IsLong(string input)
     {
-        return string.IsNullOrEmpty(input) || long.TryParse(input, out _);
+        return (input!=null) || long.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsLong

[Killed] String mutation
main/Core/Commons/ArgumentChecker.cs:34:16
 
     public static bool IsFloat(string input)
     {
-        return string.IsNullOrEmpty(input) || float.TryParse(input, out _);
+        return (input!="") || float.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsFloat

[Killed] String mutation
main/Core/Commons/ArgumentChecker.cs:39:16
 
     public static bool IsDouble(string input)
     {
-        return string.IsNullOrEmpty(input) || double.TryParse(input, out _);
+        return (input!="") || double.TryParse(input, out _);
     }
     
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDouble; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDouble; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDouble

[Killed] Logical mutation
main/Core/Commons/ArgumentChecker.cs:44:16
     
     public static bool IsDecimal(string input)
     {
-        return string.IsNullOrEmpty(input) || decimal.TryParse(input, out _);
+        return string.IsNullOrEmpty(input) && decimal.TryParse(input, out _);
     }
 
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDecimal; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDecimal; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateAnStringParameterAsDecimal

[Killed] String mutation
main/Core/Commons/ArgumentChecker.cs:70:16
     {
         IFormatProvider culture = CultureInfo.InvariantCulture;
         const DateTimeStyles styles = DateTimeStyles.AllowWhiteSpaces | DateTimeStyles.AssumeLocal;
-        return string.IsNullOrWhiteSpace(dateTimeIso8601) || DateTime.TryParse(dateTimeIso8601, culture, styles, out _);
+        return (dateTimeIso8601!=null) || DateTime.TryParse(dateTimeIso8601, culture, styles, out _);
     }
 
killedBy: UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithInvalidParameters

[Killed] Equality mutation
main/Core/Commons/ArgumentChecker.cs:93:20
         {
             JSchema schema = JSchema.Parse(input);
 
-            return schema.Properties.Count > 0 && schema.Required.Count > 0 && schema.Type.HasValue;
+            return schema.Properties.Count >= 0 && schema.Required.Count > 0 && schema.Type.HasValue;
         }
         catch (Exception)
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields

[Killed] Logical mutation
main/Core/Commons/ArgumentChecker.cs:93:20
         {
             JSchema schema = JSchema.Parse(input);
 
-            return schema.Properties.Count > 0 && schema.Required.Count > 0 && schema.Type.HasValue;
+            return schema.Properties.Count > 0 || schema.Required.Count > 0 && schema.Type.HasValue;
         }
         catch (Exception)
killedBy: UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields; UnitTest.Core.Commons.ArgumentCheckerTest.SuccessfulToValidateIfJsonSchemaHaveAllRequiredSchemaFields
