[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:11:16
 {
     public static T CheckNull<T>([AllowNull] T input, string parameterName, string message = null)
     {
-        return input is not null ? input : throw CreateArgumentNullException(parameterName, message);
+        return (false?input :throw CreateArgumentNullException(parameterName, message));
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateAnObjectParameterIfItIsNotNull

[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:16:16
 
     public static string CheckEmpty([AllowNull] string input, string parameterName, string message = null)
     {
-        return !string.IsNullOrWhiteSpace(input) ? input : throw CreateArgumentException(parameterName, message);
+        return (false?input :throw CreateArgumentException(parameterName, message));
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.SuccessfulToValidateAStringParameterIfItIsNotNull

[Killed] Conditional (true) mutation
main/Core/Commons/ArgumentValidator.cs:16:16
 
     public static string CheckEmpty([AllowNull] string input, string parameterName, string message = null)
     {
-        return !string.IsNullOrWhiteSpace(input) ? input : throw CreateArgumentException(parameterName, message);
+        return (true?input :throw CreateArgumentException(parameterName, message));
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAStringParameterIfItIsNull

[Killed] Logical mutation
main/Core/Commons/ArgumentValidator.cs:21:13
 
     public static IReadOnlyCollection<T> CheckNullOrEmpty<T>(IReadOnlyCollection<T> input, string parameterName, string message = null)
     {
-        if (input is not null && input.Count > 0) return input;
+        if (input is not null || input.Count > 0) return input;
 
         if (input is null) throw CreateArgumentNullException(parameterName, message);
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNull

[Killed] Conditional (true) mutation
main/Core/Commons/ArgumentValidator.cs:31:35
     public static void CheckNegative(int input, string parameterName, string message)
     {
         if (input >= 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = (true?$"Value cannot be negative. (Parameter '{parameterName}')" :message);
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParametersWithCustomMessage

[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:31:35
     public static void CheckNegative(int input, string parameterName, string message)
     {
         if (input >= 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = (false?$"Value cannot be negative. (Parameter '{parameterName}')" :message);
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters

[Killed] Conditional (true) mutation
main/Core/Commons/ArgumentValidator.cs:38:35
     public static void CheckNegativeOrZero(int input, string parameterName, string message)
     {
         if (input > 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = (true?$"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" :message);
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage

[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:38:35
     public static void CheckNegativeOrZero(int input, string parameterName, string message)
     {
         if (input > 0) return;
-        string exceptionMessage = string.IsNullOrEmpty(message) ? $"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" : message;
+        string exceptionMessage = (false?$"Value cannot be negative or equals to zero. (Parameter '{parameterName}')" :message);
         throw CreateArgumentException(parameterName, exceptionMessage);
     }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameter; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameter; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrEqualsToZeroParameter

[Killed] Conditional (true) mutation
main/Core/Commons/ArgumentValidator.cs:44:16
 
     private static ArgumentNullException CreateArgumentNullException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null!);
+        return (true?new ArgumentNullException(parameterName) :new ArgumentNullException(message, (Exception) null!));
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectParameterIfItIsNullWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNullWithCustomMessage

[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:44:16
 
     private static ArgumentNullException CreateArgumentNullException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message) ? new ArgumentNullException(parameterName) : new ArgumentNullException(message, (Exception) null!);
+        return (false?new ArgumentNullException(parameterName) :new ArgumentNullException(message, (Exception) null!));
     }
 
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsNull; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectParameterIfItIsNull

[Killed] Conditional (false) mutation
main/Core/Commons/ArgumentValidator.cs:49:16
 
     private static ArgumentException CreateArgumentException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message)
-            ? new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
-            : new ArgumentException(message, (Exception) null!);
+        return (false?new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
+:new ArgumentException(message, (Exception) null!));
     }
 }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAnObjectListParameterIfItIsEmpty; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateAStringParameterIfItIsNull

[Killed] Conditional (true) mutation
main/Core/Commons/ArgumentValidator.cs:49:16
 
     private static ArgumentException CreateArgumentException(string parameterName, string message)
     {
-        return string.IsNullOrEmpty(message)
-            ? new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
-            : new ArgumentException(message, (Exception) null!);
+        return (true?new ArgumentException($"Value cannot be null or empty. (Parameter '{parameterName}')")
+:new ArgumentException(message, (Exception) null!));
     }
 }
killedBy: UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeOrZeroParametersWithCustomMessage; UnitTest.Core.Commons.ArgumentValidatorTest.FailToValidateNegativeParameters
