[Survived] Null coalescing mutation (remove left)
Core/Commons/Extensions/DictionaryExtensions.cs:12:16
 
     private static Dictionary<TKey, TValue> GetEmptyDictionary<TKey, TValue>()
     {
-        return EmptyObjectDictionary as Dictionary<TKey, TValue> ?? new Dictionary<TKey, TValue>();
+        return new Dictionary<TKey, TValue>();
     }
 

[Survived] Null coalescing mutation (remove left)
Core/Commons/Extensions/DictionaryExtensions.cs:25:16
      */
     public static IDictionary<TKey, TValue> AsEmptyIfNull<TKey, TValue>(this IDictionary<TKey, TValue> dictionary)
     {
-        return dictionary ?? new Dictionary<TKey, TValue>();
+        return new Dictionary<TKey, TValue>();
     }
 }
