[Killed] Null coalescing mutation (remove left)
Core/Commons/Extensions/ListExtensions.cs:13:16
      */
     public static IList<T> AsEmptyIfNull<T>(this IList<T> list)
     {
-        return list ?? Array.Empty<T>();
+        return Array.Empty<T>();
     }
 }
killedBy: UnitTest.Core.Commons.Extensions.ListExtensionsTest.SuccessfulToReturnsAnEmptyListIfTheListIsNull
