[Killed] Conditional (false) mutation
Core/Commons/Extensions/StringExtensions.cs:23:16
         if (text is null) return null;
         if (stopAt is null) return text;
         int charLocation = text.IndexOf(stopAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? text : text[..charLocation];
+        return (false?text :text[..charLocation]);
     }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Conditional (true) mutation
Core/Commons/Extensions/StringExtensions.cs:23:16
         if (text is null) return null;
         if (stopAt is null) return text;
         int charLocation = text.IndexOf(stopAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? text : text[..charLocation];
+        return (true?text :text[..charLocation]);
     }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayOverMax; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.FailToSelectAnOutOfRangeItemInArrayUnderZero; UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectAnTokenItem

[Killed] Conditional (false) mutation
Core/Commons/Extensions/StringExtensions.cs:39:16
         if (text is null) return null;
         if (stopAt is null) return text;
         int charLocation = text.LastIndexOf(stopAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? text : text[..charLocation];
+        return (false?text :text[..charLocation]);
     }
 
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence

[Killed] Conditional (true) mutation
Core/Commons/Extensions/StringExtensions.cs:39:16
         if (text is null) return null;
         if (stopAt is null) return text;
         int charLocation = text.LastIndexOf(stopAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? text : text[..charLocation];
+        return (true?text :text[..charLocation]);
     }
 
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringBeforeTheLastSeparatorOccurrence

[Killed] Conditional (true) mutation
Core/Commons/Extensions/StringExtensions.cs:53:16
     {
         if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.IndexOf(startAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
+        return (true?string.Empty :text[(charLocation + startAt.Length)..]);
     }
 
killedBy: UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringAfterTheFirstSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringAfterTheFirstSeparatorOccurrence; UnitTest.Core.Commons.Extensions.StringExtensionsTest.SuccessfulToGetsTheSubstringAfterTheFirstSeparatorOccurrence

[Killed] Conditional (false) mutation
Core/Commons/Extensions/StringExtensions.cs:53:16
     {
         if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.IndexOf(startAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
+        return (false?string.Empty :text[(charLocation + startAt.Length)..]);
     }
 
killedBy: UnitTest.Core.Commons.Extensions.JsonExtensionsTest.SuccessfulToSelectSpecificToken

[Killed] Conditional (true) mutation
Core/Commons/Extensions/StringExtensions.cs:67:16
     {
         if (string.IsNullOrEmpty(text) || (string.IsNullOrEmpty(startAt))) return text;
         int charLocation = text.LastIndexOf(startAt, StringComparison.Ordinal);
-        return charLocation == IndexNotFound ? string.Empty : text[(charLocation + startAt.Length)..];
+        return (true?string.Empty :text[(charLocation + startAt.Length)..]);
     }
 
killedBy: UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch; UnitTest.Core.Commons.TestCaseDisplayNameComplianceTest.SuccessfulToValidateIfMethodNameAndDisplayNameMatch
