[Killed] Conditional (true) mutation
main/Core/Commons/Optional.cs:19:16
 
     public static Optional<T> Of([AllowNull] T value)
     {
-        return value is null ? Empty() : new Optional<T>(value);
+        return (true?Empty() :new Optional<T>(value));
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToGetValueIfOptionalContainsContent; UnitTest.Core.Commons.OptionalTest.SuccessToMapAnOptionalToAnotherOptionalOfDifferentInnerTypes; UnitTest.Core.Commons.OptionalTest.SuccessfulToPerformAMethodWithParametersIfTheOptionalHasContent

[Killed] Conditional (true) mutation
main/Core/Commons/Optional.cs:45:16
 
     public T OrElse(T other)
     {
-        return HasValue() ? _value : other;
+        return (true?_value :other);
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToReturnsAnAlternativeIfOptionalHasNoContent

[Killed] Conditional (false) mutation
main/Core/Commons/Optional.cs:45:16
 
     public T OrElse(T other)
     {
-        return HasValue() ? _value : other;
+        return (false?_value :other);
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToGetValueIfOptionalContainsContentIgnoringAlternative

[Killed] Conditional (true) mutation
main/Core/Commons/Optional.cs:50:16
 
     public T OrElseGet(Func<T> method)
     {
-        return HasValue() ? _value : method.Invoke();
+        return (true?_value :method.Invoke());
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToReturnsAnAlternativeIfOptionalHasNoContentUsingLambda

[Killed] Conditional (false) mutation
main/Core/Commons/Optional.cs:50:16
 
     public T OrElseGet(Func<T> method)
     {
-        return HasValue() ? _value : method.Invoke();
+        return (false?_value :method.Invoke());
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToGetValueIfOptionalContainsContentIgnoringAlternative

[Killed] Conditional (false) mutation
main/Core/Commons/Optional.cs:55:16
 
     public T OrElseThrow(Func<Exception> method)
     {
-        return HasValue() ? _value : throw method.Invoke();
+        return (false?_value :throw method.Invoke());
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToGetValueWithoutThrowExceptionIfOptionalContainsContent

[Killed] Conditional (true) mutation
main/Core/Commons/Optional.cs:55:16
 
     public T OrElseThrow(Func<Exception> method)
     {
-        return HasValue() ? _value : throw method.Invoke();
+        return (true?_value :throw method.Invoke());
     }
 
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessfulToThrowsExceptionIfTheOptionalHasNoContent

[Killed] Conditional (false) mutation
main/Core/Commons/Optional.cs:60:16
 
     public Optional<TU> Map<TU>(Func<T, TU> method)
     {
-        return HasValue() ? new Optional<TU>(method.Invoke(_value)) : default;
+        return (false?new Optional<TU>(method.Invoke(_value)) :default);
     }
 }
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessToMapAnOptionalToAnotherOptionalOfDifferentInnerTypes

[Killed] Conditional (true) mutation
main/Core/Commons/Optional.cs:60:16
 
     public Optional<TU> Map<TU>(Func<T, TU> method)
     {
-        return HasValue() ? new Optional<TU>(method.Invoke(_value)) : default;
+        return (true?new Optional<TU>(method.Invoke(_value)) :default);
     }
 }
killedBy: UnitTest.Core.Commons.OptionalTest.SuccessToMapAnEmptyOptionalToAnotherEmptyOptionalOfDifferentInnerTypes
