[Survived] Arithmetic mutation
main/Core/Commons/RandomNumberGenerator.cs:17:46
 
         int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 + 1;
 
-        int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;
+        int scaledNumber = (int) Math.Floor((max - min - 1) * (randomNumber / (double) int.MaxValue)) + min;
 
         return Math.Min(max, Math.Max(min, scaledNumber));

[Survived] Arithmetic mutation
main/Core/Commons/RandomNumberGenerator.cs:17:45
 
         int randomNumber = BitConverter.ToInt32(randomBytes, 0) % 100 + 1;
 
-        int scaledNumber = (int) Math.Floor((max - min + 1) * (randomNumber / (double) int.MaxValue)) + min;
+        int scaledNumber = (int) Math.Floor((max - min + 1) / (randomNumber / (double) int.MaxValue)) + min;
 
         return Math.Min(max, Math.Max(min, scaledNumber));
