[Killed] Statement mutation
Domains/Transactions/Commands/RegisterTransactionCommandValidator.cs:11:9
 {
     public RegisterTransactionCommandValidator()
     {
-        RuleFor(command => command.Description)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationTransactionDescriptionIsNullOrEmpty");
+        ;
         
         RuleFor(command => command.Amount)
killedBy: UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithEmptyParameters

[Killed] String mutation
Domains/Transactions/Commands/RegisterTransactionCommandValidator.cs:14:26
         RuleFor(command => command.Description)
             .Cascade(CascadeMode.Stop)
             .NotEmpty()
-            .WithMessage("ValidationTransactionDescriptionIsNullOrEmpty");
+            .WithMessage("");
         
         RuleFor(command => command.Amount)
killedBy: UnitTest.Core.Domains.Transactions.UseCases.RegisterTransactionUseCaseTest.SuccessfulToRegisterTransaction

[Killed] Statement mutation
Domains/Transactions/Commands/RegisterTransactionCommandValidator.cs:16:9
             .NotEmpty()
             .WithMessage("ValidationTransactionDescriptionIsNullOrEmpty");
         
-        RuleFor(command => command.Amount)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationTransactionAmountIsNullOrEmpty")
-            .Must(ArgumentChecker.IsDecimal)
-            .WithMessage("ValidationTransactionAmountIsNotDecimal");
+        ;
         
         RuleFor(command => command.Type)
killedBy: UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithEmptyParameters; UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithInvalidParameters

[Killed] Statement mutation
Domains/Transactions/Commands/RegisterTransactionCommandValidator.cs:23:9
             .Must(ArgumentChecker.IsDecimal)
             .WithMessage("ValidationTransactionAmountIsNotDecimal");
         
-        RuleFor(command => command.Type)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationTransactionTypeIsNullOrEmpty")
-            .Must(ArgumentChecker.IsValidEnumOf<Type>)
-            .WithMessage("ValidationTransactionTypeIsInvalid");
+        ;
         
         RuleFor(command => command.Date)
killedBy: UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithEmptyParameters; UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithInvalidParameters

[Killed] Statement mutation
Domains/Transactions/Commands/RegisterTransactionCommandValidator.cs:30:9
             .Must(ArgumentChecker.IsValidEnumOf<Type>)
             .WithMessage("ValidationTransactionTypeIsInvalid");
         
-        RuleFor(command => command.Date)
-            .Cascade(CascadeMode.Stop)
-            .NotEmpty()
-            .WithMessage("ValidationTransactionDateIsNullOrEmpty")
-            .Must(ArgumentChecker.BeEmptyOrAValidDate)
-            .WithMessage("ValidationTransactionDateIsInvalid");
+        ;
     }
 }
killedBy: UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithEmptyParameters; UnitTest.Core.Domains.Transactions.Command.RegisterTransactionCommandTest.FailToRegisterTransactionWithInvalidParameters
