[Killed] Block removal mutation
Domains/Transactions/UseCases/RegisterTransactionUseCase.cs:18:5
     private readonly IGetDateTime _getDateTime;
     
     public RegisterTransactionUseCase(IServiceResolver serviceResolver)
-    {
-        ArgumentValidator.CheckNull(serviceResolver, nameof(serviceResolver));
-        _registerTransactionGateway = serviceResolver.Resolve<IRegisterTransactionGateway>();
-        _getDateTime = serviceResolver.Resolve<IGetDateTime>();
-    }
+    {}
     
     public async Task<Transaction> ExecuteAsync(RegisterTransactionCommand command)
killedBy: UnitTest.Core.Domains.Transactions.UseCases.RegisterTransactionUseCaseTest.SuccessfulToRegisterTransaction
