[Killed] Object initializer mutation
EntryPoint.WebApi/Commons/Controllers/ResponseBuilder.cs:12:37
 {
     public static Task<IActionResult> BuildResponse(HttpStatusCode httpStatusCode, object payload = null)
     {
-        ObjectResult objectResult = new ObjectResult(payload)
-        {
-            Formatters = new FormatterCollection<IOutputFormatter>(),
-            DeclaredType = payload?.GetType(),
-            StatusCode = (int) httpStatusCode
-        };
+        ObjectResult objectResult = new ObjectResult(payload)
+{};
 
         return Task.FromResult<IActionResult>(objectResult);
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToHandleException
