[Killed] Null coalescing mutation (remove left)
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:23:26
 
     public static string MessageFormatter(string messageKey, params object[] args)
     {
-        string message = Messages.ResourceManager.GetString(messageKey, CultureInfo.DefaultThreadCurrentCulture) ?? messageKey;
+        string message = messageKey;
         return args is null ? message : string.Format(message, args);
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToFormatMessageIfKeyExistsInTheResourceFileForDefaultCulture; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToFormatMessageIfKeyExistsInTheResourceFileForPtBrCulture

[Killed] Conditional (true) mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:24:16
     public static string MessageFormatter(string messageKey, params object[] args)
     {
         string message = Messages.ResourceManager.GetString(messageKey, CultureInfo.DefaultThreadCurrentCulture) ?? messageKey;
-        return args is null ? message : string.Format(message, args);
+        return (true?message :string.Format(message, args));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToFormatMessageIfKeyExistsInTheResourceFileForDefaultCulture; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToFormatMessageIfKeyExistsInTheResourceFileForPtBrCulture

[Killed] Conditional (false) mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:64:16
 
     private static string GetPropertyName(string propertyPath)
     {
-        return !propertyPath.Contains('.') ? propertyPath : propertyPath.SubstringAfter(".");
+        return (false?propertyPath :propertyPath.SubstringAfter("."));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingInvalidArgumentException; IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationException

[Killed] Conditional (true) mutation
EntryPoint.WebApi/Commons/Exceptions/IExceptionHandler.cs:64:16
 
     private static string GetPropertyName(string propertyPath)
     {
-        return !propertyPath.Contains('.') ? propertyPath : propertyPath.SubstringAfter(".");
+        return (true?propertyPath :propertyPath.SubstringAfter("."));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ExceptionHandlerTest.SuccessfulToBuildHttpResponseStatusHandlingValidationExceptionWithNestedObject
