[Killed] Statement mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:20:9
 
     public override void OnResultExecuting(ResultExecutingContext context)
     {
-        context.HttpContext.Response.Headers.Append(CorrelationIdHeader, GetCorrelationId(context));
+        ;
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToGenerateCorrelationIdIfItIsMissingFromRequestHeaders; IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeadersEvenIfRequestDoesNotContainCorrelationId

[Killed] Conditional (false) mutation
EntryPoint.WebApi/Commons/Filters/AddCorrelationIdHeaderAttribute.cs:35:16
         if (!headers.TryGetValue(CorrelationIdHeader, out StringValues values)) return Optional<string>.Empty();
 
         string correlationId = values.ToList()[0];
-        return !string.IsNullOrWhiteSpace(correlationId) ? Optional<string>.Of(correlationId) : Optional<string>.Empty();
+        return (false?Optional<string>.Of(correlationId) :Optional<string>.Empty());
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.Filters.AddCorrelationIdHeaderAttributeTest.SuccessfulToAddCorrelationIdToResponseHeaders
