[Killed] Conditional (true) mutation
main/EntryPoint.WebApi/Commons/GetCorrelationId.cs:34:16
         if (!headers.TryGetValue(CorrelationIdHeader, out StringValues values)) return Optional<string>.Empty();
 
         string correlationId = values.ToList()[0];
-        return !string.IsNullOrWhiteSpace(correlationId) ? Optional<string>.Of(correlationId) : Optional<string>.Empty();
+        return (true?Optional<string>.Of(correlationId) :Optional<string>.Empty());
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.GetCorrelationIdTest.SuccessfulToGenerateCorrelationIdIfItIsMissing
