[Killed] Conditional (false) mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:19:16
 
     public static string Sanitize(string[] sortableFields, List<string> rawOrderBys)
     {
-        return rawOrderBys != null ? Sanitize(sortableFields, string.Join(",", rawOrderBys)) : string.Empty;
+        return (false?Sanitize(sortableFields, string.Join(",", rawOrderBys)) :string.Empty);
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:24:59
 
     public static string Sanitize(string[] sortableFields, string rawOrderBy)
     {
-        if (string.IsNullOrWhiteSpace(rawOrderBy)) return string.Empty;
+        if (string.IsNullOrWhiteSpace(rawOrderBy)) return "Stryker was here!";
 
         string orderBy = BlankSpaces().Replace(rawOrderBy, "");
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToSanitizeEmptyOrdersByQueryParameters

[Killed] Conditional (true) mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:32:37
 
         foreach (string value in values)
         {
-            AddDirection(sanitized, IsDirectionCommand(value) ? value : AscendingDirection);
+            AddDirection(sanitized, (true?value :AscendingDirection));
             if (sortableFields == null) continue;
             foreach (string field in sortableFields)
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:44:56
 
         AddDirection(sanitized, AscendingDirection);
 
-        return string.Join(",", sanitized.Where(it => !string.IsNullOrEmpty(it)));
+        return string.Join(",", sanitized.Where(it => !(it!="")));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] Logical mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:49:13
 
     private static void AddDirection(IList<string> sanitized, string value)
     {
-        if (sanitized.Count <= 0 || IsDirectionCommand(sanitized[^1])) return;
+        if (sanitized.Count <= 0 && IsDirectionCommand(sanitized[^1])) return;
         sanitized[^1] = string.Concat(sanitized[^1], ":", value.ToUpper());
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders

[Killed] String mutation
main/EntryPoint.WebApi/Commons/OrderByHelper.cs:57:32
     {
         return DescendingDirection.Equals(value, StringComparison.InvariantCultureIgnoreCase) ||
                value!.EndsWith($":{AscendingDirection}", StringComparison.InvariantCultureIgnoreCase) ||
-               value!.EndsWith($":{DescendingDirection}", StringComparison.InvariantCultureIgnoreCase);
+               value!.EndsWith($"", StringComparison.InvariantCultureIgnoreCase);
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders; IntegrationTest.EntryPoint.WebApi.Commons.OrderByHelperTest.SuccessfulToFilterAndSanitizeSeveralTypesOfOrders
