[Killed] Logical mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:21:24
     public static PageRequest Of(string rawPageNumber, string rawPageSize, string rawOrderBy)
     {
         int pageNumber = int.TryParse(rawPageNumber, out int intPageNumber) ? intPageNumber : 0;
-        int pageSize = int.TryParse(rawPageSize, out int intPageSize) && intPageSize > 0 ? intPageSize : PageRequest.DefaultPageSize;
+        int pageSize = int.TryParse(rawPageSize, out int intPageSize) || intPageSize > 0 ? intPageSize : PageRequest.DefaultPageSize;
         return PageRequest.Of(pageNumber, pageSize, GetSort(rawOrderBy));
     }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreInvalidAndSortIsInvalid

[Killed] String mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:27:13
 
     private static Sort GetSort(string rawOrderBy)
     {
-        if (string.IsNullOrWhiteSpace(rawOrderBy)) return Sort.Unsorted;
+        if ((rawOrderBy.Trim()!="")) return Sort.Unsorted;
 
         string orderBy = BlankSpaces().Replace(rawOrderBy, "");
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreNull; IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Conditional (true) mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:37:16
             .Select(it => it.SubstringBefore(DirectionSeparator))
             .Where(it => !string.IsNullOrWhiteSpace(it)).ToList();
         
-        return properties.Count == 0 ? Sort.Unsorted : Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList());
+        return (true?Sort.Unsorted :Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList()));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Conditional (false) mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:37:16
             .Select(it => it.SubstringBefore(DirectionSeparator))
             .Where(it => !string.IsNullOrWhiteSpace(it)).ToList();
         
-        return properties.Count == 0 ? Sort.Unsorted : Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList());
+        return (false?Sort.Unsorted :Sort.By(properties.Select(property => GetOrder(property, orderBy)).ToList()));
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithDefaultValuesWhenParametersAreInvalidAndSortIsInvalid

[Killed] Conditional (true) mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:50:16
     {
         string direction = orderBy.SubstringAfter(property + DirectionSeparator).SubstringBefore(FieldSeparator);
         bool isDescending = string.Equals(direction, Convert.ToString(Direction.Desc), StringComparison.InvariantCultureIgnoreCase);
-        return isDescending ? Direction.Desc : Direction.Asc;
+        return (true?Direction.Desc :Direction.Asc);
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort

[Killed] Conditional (false) mutation
main/EntryPoint.WebApi/Commons/PageRequestHelper.cs:50:16
     {
         string direction = orderBy.SubstringAfter(property + DirectionSeparator).SubstringBefore(FieldSeparator);
         bool isDescending = string.Equals(direction, Convert.ToString(Direction.Desc), StringComparison.InvariantCultureIgnoreCase);
-        return isDescending ? Direction.Desc : Direction.Asc;
+        return (false?Direction.Desc :Direction.Asc);
     }
 }
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.PageRequestHelperTest.SuccessfulToCreateAnPageRequestWithPageNumberPageSizeAndSort
