[Killed] Null coalescing mutation (remove left)
main/EntryPoint.WebApi/Commons/ServiceResolver.cs:16:27
     public void Setup(IServiceProvider serviceProvider, Dictionary<Type, ServiceLifetime> lifetimeByType = null)
     {
         _serviceProvider = serviceProvider;
-        _lifetimeByType = lifetimeByType ?? new Dictionary<Type, ServiceLifetime>(0);
+        _lifetimeByType = new Dictionary<Type, ServiceLifetime>(0);
     }
 
killedBy: IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.FailToResolveSingletonService; IntegrationTest.EntryPoint.WebApi.Commons.ServiceResolverTest.SuccessfulToResolveSingletonService
