[NoCoverage] Conditional (true) mutation
Infra.PostgreSql/Commons/Helpers/SortHelper.cs:13:30
     public static SortDefinition<T> GetSortDefinitions<T>(IEnumerable<Order> orders)
     {
         List<SortDefinition<T>> definitions = orders
-            .Select(order => order.Direction == Direction.Asc
-                ? Builders<T>.Sort.Ascending(order.Property)
-                : Builders<T>.Sort.Descending(order.Property))
+            .Select(order => (true?Builders<T>.Sort.Ascending(order.Property)
+:Builders<T>.Sort.Descending(order.Property)))
             .ToList();
 
