[Killed] Equality mutation
Infra.PostgreSql/Commons/Helpers/UpdateHelper.cs:17:13
         T newValue
     )
     {
-        if (currentValue is not null && CompareItem(currentValue, newValue)) return;
+        if (currentValue is null && CompareItem(currentValue, newValue)) return;
         definitions.Add(Builders<TU>.Update.Set(fieldName, newValue));
     }
killedBy: IntegrationTest.Infra.PostgreSql.Commons.UpdateDefinitionHelperTest.FailToAddUpDefinitionIfValueHasNotChanged

[Killed] Boolean mutation
Infra.PostgreSql/Commons/Helpers/UpdateHelper.cs:40:53
 
     private static bool CompareList<T>(List<T> first, List<T> second)
     {
-        if (first is null && second is null) return true;
+        if (first is null && second is null) return false;
         if (first is null || second is null) return false;
 
killedBy: IntegrationTest.Infra.PostgreSql.Commons.UpdateDefinitionHelperTest.FailToAddMultipleUpDefinitionsIfValuesAreNull

[Killed] Logical mutation
Infra.PostgreSql/Commons/Helpers/UpdateHelper.cs:41:13
     private static bool CompareList<T>(List<T> first, List<T> second)
     {
         if (first is null && second is null) return true;
-        if (first is null || second is null) return false;
+        if (first is null && second is null) return false;
 
         return !first.Except(second).Any() && !second.Except(first).Any();
killedBy: IntegrationTest.Infra.PostgreSql.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfCurrentValueIsNull; IntegrationTest.Infra.PostgreSql.Commons.UpdateDefinitionHelperTest.SuccessfulToAddMultipleUpDefinitionsIfNewValueIsNull
