[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Connection/ConnectionFactory.cs:10:5
 {
 
     public DbConnection GetConnection()
-    {
-        return new NpgsqlConnection(connectionString);
-    }
+    {}
 }
 
