[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Context/DbContext.cs:16:29
 
     private bool _disposed;
 
-    ~DbContext() => Dispose(false);
+    ~DbContext() => Dispose(true);
 
     [ExcludeFromCodeCoverage]    

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Context/DbContext.cs:25:52
     {
         _id = Guid.NewGuid();
         _dataSource = dataSource;
-        DefaultTypeMap.MatchNamesWithUnderscores = false;
+        DefaultTypeMap.MatchNamesWithUnderscores = true;
     }
 

[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Context/DbContext.cs:29:5
     }
 
     public DbConnection GetConnection()
-    {
-        return _dataSource.CreateConnection();
-    }
+    {}
     
     [ExcludeFromCodeCoverage]

[NoCoverage] Logical mutation
Infra.PostgreSql/Commons/Context/DbContext.cs:42:13
 
     private void Dispose(bool disposing)
     {
-        if (_disposed || !disposing) return;
+        if (_disposed && !disposing) return;
         _disposed = true;
     }

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/DbContext.cs:42:38
 
     private void Dispose(bool disposing)
     {
-        if (_disposed || !disposing) return;
+        if (_disposed || !disposing) ;
         _disposed = true;
     }

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Context/DbContext.cs:43:21
     private void Dispose(bool disposing)
     {
         if (_disposed || !disposing) return;
-        _disposed = true;
+        _disposed = false;
     }
 }
