[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:24:34
 
         private bool _disposed;
 
-        ~UnitOfWork() => Dispose(false);
+        ~UnitOfWork() => Dispose(true);
 
         [ExcludeFromCodeCoverage]

[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:30:9
         public override string ToString() => $"UnitOfWork: {_id}";
 
         public UnitOfWork(DbContext dbContext)
-        {
-            _id = Guid.NewGuid();
-            DbContext = dbContext;
-            Transactions = new TransactionRepository(this);
-        }
+        {}
 
         [ExcludeFromCodeCoverage]

[NoCoverage] Negate expression
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:45:17
 
         private void Dispose(bool disposing)
         {
-            if (_disposed || !disposing) 
+            if (!(_disposed || !disposing)) 
                 return;
             _disposed = true;

[NoCoverage] Logical mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:45:17
 
         private void Dispose(bool disposing)
         {
-            if (_disposed || !disposing) 
+            if (_disposed && !disposing) 
                 return;
             _disposed = true;

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:46:17
         private void Dispose(bool disposing)
         {
             if (_disposed || !disposing) 
-                return;
+                ;
             _disposed = true;
         }

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:47:25
         {
             if (_disposed || !disposing) 
                 return;
-            _disposed = true;
+            _disposed = false;
         }
 

[NoCoverage] Null coalescing mutation (remove left)
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:54:20
         {
             // Return the writable connection if it is open
             // Otherwise, return a read-only connection
-            return _connection ?? DbContext.GetConnection();
+            return DbContext.GetConnection();
         }
 

[NoCoverage] Equality mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:61:17
         {
             // Return the writable connection if it is open
             // Otherwise, throw an exception because we cannot write without a transaction
-            if (_connection != null)
+            if (_connection == null)
             {
                 return _connection;

[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:62:13
             // Return the writable connection if it is open
             // Otherwise, throw an exception because we cannot write without a transaction
             if (_connection != null)
-            {
-                return _connection;
-            }
+            {}
             throw new InvalidOperationException("There is no active transaction");
         }

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:65:13
             {
                 return _connection;
             }
-            throw new InvalidOperationException("There is no active transaction");
+            ;
         }
 

[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:69:9
         }
 
         public IDbTransaction GetTransaction()
-        {
-            return _transaction;
-        }
+        {}
 
         public T Invoke<T>(Func<Task<T>> method)

[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:74:9
         }
 
         public T Invoke<T>(Func<Task<T>> method)
-        {
-            return ExecuteInTransaction(method);
-        }
+        {}
 
         public void Invoke(Func<Task> method)

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:80:13
 
         public void Invoke(Func<Task> method)
         {
-            ExecuteInTransaction(method);
+            ;
         }
 

[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:84:9
         }
 
         public async Task<T> InvokeAsync<T>(Func<Task<T>> method)
-        {
-            return await Task.Run(() => ExecuteInTransaction(method));
-        }
+        {}
 
         public async Task InvokeAsync(Func<Task> method)

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:90:13
 
         public async Task InvokeAsync(Func<Task> method)
         {
-            await ExecuteInTransactionAsync(async () => await method());
+            ;
         }
         

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:95:13
         
         private async Task ExecuteInTransactionAsync(Func<Task> method)
         {
-            await Task.Run(() => ExecuteInTransaction(method));
+            ;
         }
 

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:100:13
 
         private void ExecuteInTransaction(Func<Task> method)
         {
-            ExecuteInTransaction<object>(async () =>
-            {
-                await method();
-                return 0;
-            });
+            ;
         }
 

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:102:17
         {
             ExecuteInTransaction<object>(async () =>
             {
-                await method();
+                ;
                 return 0;
             });

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:110:13
         private T ExecuteInTransaction<T>(Func<Task<T>> method)
         {
             using IDbConnection connection = DbContext.GetConnection();
-            connection.Open();
+            ;
 
             using IDbTransaction transaction = connection.BeginTransaction(IsolationLevel.Serializable);

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:119:17
             try
             {
                 T result = method().GetAwaiter().GetResult();
-                _transaction.Commit();
+                ;
                 return result;
             }

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:124:17
             }
             catch (Exception)
             {
-                _transaction.Rollback();
+                ;
                 throw;
             }

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:125:17
             catch (Exception)
             {
                 _transaction.Rollback();
-                throw;
+                ;
             }
             finally

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:129:17
             }
             finally
             {
-                CleanupTransaction();
+                ;
             }
         }

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Context/UnitOfWork.cs:135:13
 
         private void CleanupTransaction()
         {
-            _transaction?.Dispose();
+            ;
             _transaction = null;
             _connection = null;
