[Killed] Equality mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:21:32
 
         Dictionary<string, string> columnTable = BuildEntityDictionary(properties);
         Dictionary<string, string> columnTableWithoutKey = columnTable
-            .Where(keyValue => keyValue.Key != keyProperty)
+            .Where(keyValue => keyValue.Key == keyProperty)
             .ToDictionary(keyValue => keyValue.Key, keyValue => keyValue.Value);
 
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToBuildSelectSqlTemplate

[Killed] String mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:25:46
             .ToDictionary(keyValue => keyValue.Key, keyValue => keyValue.Value);
 
         string keyColumn = columnTable[keyProperty];
-        string noKeyProperties = string.Join(", ", columnTableWithoutKey.Keys.Select(key => $"@{key}"));
+        string noKeyProperties = string.Join("", columnTableWithoutKey.Keys.Select(key => $"@{key}"));
         string noKeyColumns = string.Join(", ", columnTableWithoutKey.Values);
         string columns = string.Join(", ", columnTable.Select(keyValue => $"{keyValue.Value} AS {keyValue.Key}"));
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToBuildSelectSqlTemplate

[Killed] String mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:34:22
             TableName = tableName,
             KeyProperty = keyProperty,
             Insert = $"INSERT INTO {tableName} ({noKeyColumns}) VALUES ({noKeyProperties}) RETURNING {keyColumn} AS {keyProperty}",
-            Select = $"SELECT {columns} FROM {tableName} ",
+            Select = $"",
             SelectByKeyId = $"SELECT {columns} FROM {tableName} WHERE {keyColumn} = @{keyProperty}",
             Count = $"SELECT COUNT(*) FROM {tableName} ",
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToBuildSelectSqlTemplate

[Killed] Equality mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:49:13
     private static string GetTableName<T>()
     {
         TableAttribute attribute = typeof(T).GetCustomAttribute<TableAttribute>();
-        if (attribute != null) return attribute.Name;
+        if (attribute == null) return attribute.Name;
         throw new ArgumentException($"The type {typeof(T).Name} does not have a Table Attribute defined.");
     }
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.FailToGetTableNameFromEntityWithoutTableAttribute; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToBuildSelectSqlTemplate

[Killed] Statement mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:50:9
     {
         TableAttribute attribute = typeof(T).GetCustomAttribute<TableAttribute>();
         if (attribute != null) return attribute.Name;
-        throw new ArgumentException($"The type {typeof(T).Name} does not have a Table Attribute defined.");
+        ;
     }
 
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.FailToGetTableNameFromEntityWithoutTableAttribute

[Killed] Block removal mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:54:5
     }
 
     public static Dictionary<string, string> GetEntityDictionary<T>(bool excludeKey = false)
-    {
-        List<PropertyInfo> properties = GetDecorateProperties<T>(excludeKey);
-        return BuildEntityDictionary(properties);
-    }
+    {}
 
     private static List<PropertyInfo> GetDecorateProperties<T>(bool excludeKey = false)
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetPropertyNamesExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetAllColumns; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetConversionTable

[Killed] Linq method mutation (OrderByDescending() to OrderBy())
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:61:16
 
     private static List<PropertyInfo> GetDecorateProperties<T>(bool excludeKey = false)
     {
-        return typeof(T).GetProperties()
-            .Where(property => property.GetCustomAttribute<ColumnAttribute>() != null)
-            .Where(property => !excludeKey || property.GetCustomAttribute<KeyAttribute>() == null)
-            .OrderByDescending(property => property.GetCustomAttribute<KeyAttribute>() != null)
+        return typeof(T).GetProperties()
+            .Where(property => property.GetCustomAttribute<ColumnAttribute>() != null)
+            .Where(property => !excludeKey || property.GetCustomAttribute<KeyAttribute>() == null)
+            .OrderBy(property => property.GetCustomAttribute<KeyAttribute>() != null)
             .ToList();
     }
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetAllColumns; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetPropertyNames; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToBuildSelectSqlTemplate

[Killed] Equality mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:62:32
     private static List<PropertyInfo> GetDecorateProperties<T>(bool excludeKey = false)
     {
         return typeof(T).GetProperties()
-            .Where(property => property.GetCustomAttribute<ColumnAttribute>() != null)
+            .Where(property => property.GetCustomAttribute<ColumnAttribute>() == null)
             .Where(property => !excludeKey || property.GetCustomAttribute<KeyAttribute>() == null)
             .OrderByDescending(property => property.GetCustomAttribute<KeyAttribute>() != null)
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetPropertyNamesExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetAllColumns

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:63:32
     {
         return typeof(T).GetProperties()
             .Where(property => property.GetCustomAttribute<ColumnAttribute>() != null)
-            .Where(property => !excludeKey || property.GetCustomAttribute<KeyAttribute>() == null)
+            .Where(property => excludeKey || property.GetCustomAttribute<KeyAttribute>() == null)
             .OrderByDescending(property => property.GetCustomAttribute<KeyAttribute>() != null)
             .ToList();
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetPropertyNamesExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetAllColumns

[Killed] Logical mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:63:32
     {
         return typeof(T).GetProperties()
             .Where(property => property.GetCustomAttribute<ColumnAttribute>() != null)
-            .Where(property => !excludeKey || property.GetCustomAttribute<KeyAttribute>() == null)
+            .Where(property => !excludeKey && property.GetCustomAttribute<KeyAttribute>() == null)
             .OrderByDescending(property => property.GetCustomAttribute<KeyAttribute>() != null)
             .ToList();
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetPropertyNamesExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetAllColumns

[Killed] Equality mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:64:44
         return typeof(T).GetProperties()
             .Where(property => property.GetCustomAttribute<ColumnAttribute>() != null)
             .Where(property => !excludeKey || property.GetCustomAttribute<KeyAttribute>() == null)
-            .OrderByDescending(property => property.GetCustomAttribute<KeyAttribute>() != null)
+            .OrderByDescending(property => property.GetCustomAttribute<KeyAttribute>() == null)
             .ToList();
     }
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetAllColumns; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetPropertyNames; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToBuildSelectSqlTemplate

[Survived] Boolean mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:74:95
 
         foreach (PropertyInfo property in properties)
         {
-            object[] columnAttributes = property.GetCustomAttributes(typeof(ColumnAttribute), true);
+            object[] columnAttributes = property.GetCustomAttributes(typeof(ColumnAttribute), false);
             ColumnAttribute columnAttribute = (ColumnAttribute) columnAttributes[0];
             dictionary.Add(property.Name, columnAttribute.Name);

[Killed] Statement mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:76:13
         {
             object[] columnAttributes = property.GetCustomAttributes(typeof(ColumnAttribute), true);
             ColumnAttribute columnAttribute = (ColumnAttribute) columnAttributes[0];
-            dictionary.Add(property.Name, columnAttribute.Name);
+            ;
         }
 
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetPropertyNamesExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetAllColumns

[Survived] Boolean mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:86:89
     {
         foreach (PropertyInfo property in properties)
         {
-            object[] keyAttributes = property.GetCustomAttributes(typeof(KeyAttribute), true);
+            object[] keyAttributes = property.GetCustomAttributes(typeof(KeyAttribute), false);
             if (keyAttributes.Length <= 0) continue;
             return property.Name;

[Killed] Equality mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:87:17
         foreach (PropertyInfo property in properties)
         {
             object[] keyAttributes = property.GetCustomAttributes(typeof(KeyAttribute), true);
-            if (keyAttributes.Length <= 0) continue;
+            if (keyAttributes.Length < 0) continue;
             return property.Name;
         }
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.FailToGetKeyPropertyName; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetKeyPropertyName

[Killed] Negate expression
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:87:17
         foreach (PropertyInfo property in properties)
         {
             object[] keyAttributes = property.GetCustomAttributes(typeof(KeyAttribute), true);
-            if (keyAttributes.Length <= 0) continue;
+            if (!(keyAttributes.Length <= 0)) continue;
             return property.Name;
         }
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.FailToGetKeyPropertyName; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToGetColumnsExcludingKey; IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.SuccessfulToBuildSelectSqlTemplate

[Killed] Statement mutation
Infra.PostgreSql/Commons/Filter/DapperSqlHelper.cs:91:9
             return property.Name;
         }
 
-        throw new ArgumentException($"The type {typeof(T).Name} does not have a Key Attribute defined.");
+        ;
     }
 }
killedBy: IntegrationTest.Infra.PostgreSql.Commons.DapperSqlHelperTest.FailToGetKeyPropertyName
