[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Filter/FilterDefinition.cs:14:5
     public readonly object Value;
 
     public FilterDefinition(string property, SqlOperator sqlOperator, object value)
-    {
-        Property = property;
-        SqlOperator = sqlOperator;
-        Value = value;
-    }
+    {}
     
     private bool Equals(FilterDefinition other)

[NoCoverage] Equality mutation
Infra.PostgreSql/Commons/Filter/FilterDefinition.cs:22:16
     
     private bool Equals(FilterDefinition other)
     {
-        return Property == other.Property 
+        return Property != other.Property 
                && SqlOperator == other.SqlOperator 
                && Equals(Value, other.Value);

[NoCoverage] Logical mutation
Infra.PostgreSql/Commons/Filter/FilterDefinition.cs:22:16
     
     private bool Equals(FilterDefinition other)
     {
-        return Property == other.Property 
-               && SqlOperator == other.SqlOperator 
+        return Property == other.Property 
+               || SqlOperator == other.SqlOperator 
                && Equals(Value, other.Value);
     }

[NoCoverage] Equality mutation
Infra.PostgreSql/Commons/Filter/FilterDefinition.cs:23:19
     private bool Equals(FilterDefinition other)
     {
         return Property == other.Property 
-               && SqlOperator == other.SqlOperator 
+               && SqlOperator != other.SqlOperator 
                && Equals(Value, other.Value);
     }
