[Survived] String mutation
Infra.PostgreSql/Commons/Filter/SqlOperator.cs:12:77
     public static readonly SqlOperator GreaterThan = new SqlOperator(2, ">");
     public static readonly SqlOperator GreaterThanOrEqual = new SqlOperator(3, ">=");
     public static readonly SqlOperator LessThan = new SqlOperator(4, "<");
-    public static readonly SqlOperator LessThanOrEqual = new SqlOperator(5, "<=");
+    public static readonly SqlOperator LessThanOrEqual = new SqlOperator(5, "");
     public static readonly SqlOperator Like = new SqlOperator(6, "LIKE");
     public static readonly SqlOperator In = new SqlOperator(7, "IN");

[Survived] String mutation
Infra.PostgreSql/Commons/Filter/SqlOperator.cs:14:64
     public static readonly SqlOperator LessThan = new SqlOperator(4, "<");
     public static readonly SqlOperator LessThanOrEqual = new SqlOperator(5, "<=");
     public static readonly SqlOperator Like = new SqlOperator(6, "LIKE");
-    public static readonly SqlOperator In = new SqlOperator(7, "IN");
+    public static readonly SqlOperator In = new SqlOperator(7, "");
 
     private SqlOperator(int id, string name) : base(id, name)
