[NoCoverage] Block removal mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:22:5
     private readonly IUnitOfWork _unitOfWork;
 
     protected Repository(IUnitOfWork unitOfWork)
-    {
-        _unitOfWork = unitOfWork;
-    }
+    {}
 
     public async Task<T> AddAsync(T entity)

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:30:109
     {
         IDbConnection connection = _unitOfWork.GetWritableConnection();
         IDbTransaction transaction = _unitOfWork.GetTransaction();
-        long id = await connection.ExecuteScalarAsync<long>(Sql.Insert, entity, transaction).ConfigureAwait(true);
+        long id = await connection.ExecuteScalarAsync<long>(Sql.Insert, entity, transaction).ConfigureAwait(false);
         entity.Id = id;
 

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:40:127
     {
         IDbConnection connection = _unitOfWork.GetConnection();
         IDbTransaction transaction = _unitOfWork.GetTransaction();
-        T entity = await connection.QueryFirstOrDefaultAsync<T>(Sql.SelectByKeyId, new {Id = id}, transaction).ConfigureAwait(false);
+        T entity = await connection.QueryFirstOrDefaultAsync<T>(Sql.SelectByKeyId, new {Id = id}, transaction).ConfigureAwait(true);
 
         return Optional<T>.Of(entity);

[NoCoverage] Collection initializer mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:47:34
 
     public async Task<Optional<T>> GetOneAsync(FilterDefinition filterDefinition)
     {
-        return await GetOneAsync(new List<FilterDefinition> {filterDefinition});
+        return await GetOneAsync(new List<FilterDefinition> {});
     }
 

[NoCoverage] Conditional (false) mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:60:30
             .Select(filter => new KeyValuePair<string, object>(filter.Property, CleanParameter(filter.Value)))
             .ToList();
 
-        string whereClause = !string.IsNullOrEmpty(aggregate) ? $"WHERE {aggregate}" : "";
+        string whereClause = (false?$"WHERE {aggregate}" :"");
         string query = $"{Sql.Select}{whereClause}";
 

[NoCoverage] Conditional (true) mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:60:30
             .Select(filter => new KeyValuePair<string, object>(filter.Property, CleanParameter(filter.Value)))
             .ToList();
 
-        string whereClause = !string.IsNullOrEmpty(aggregate) ? $"WHERE {aggregate}" : "";
+        string whereClause = (true?$"WHERE {aggregate}" :"");
         string query = $"{Sql.Select}{whereClause}";
 

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:65:112
 
         IDbConnection connection = _unitOfWork.GetConnection();
         IDbTransaction transaction = _unitOfWork.GetTransaction();
-        T entity = await connection.QueryFirstOrDefaultAsync<T>(query, parameters, transaction).ConfigureAwait(false);
+        T entity = await connection.QueryFirstOrDefaultAsync<T>(query, parameters, transaction).ConfigureAwait(true);
 
         return Optional<T>.Of(entity);

[NoCoverage] Conditional (false) mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:72:16
 
     private static object CleanParameter(object parameter)
     {
-        return parameter is string ? $"{parameter.ToString()?.Replace("'", "''")}" : parameter;
+        return (false?$"{parameter.ToString()?.Replace("'", "''")}" :parameter);
     }
 

[NoCoverage] Conditional (true) mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:72:16
 
     private static object CleanParameter(object parameter)
     {
-        return parameter is string ? $"{parameter.ToString()?.Replace("'", "''")}" : parameter;
+        return (true?$"{parameter.ToString()?.Replace("'", "''")}" :parameter);
     }
 

[NoCoverage] Collection initializer mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:77:32
 
     public async Task<Page<T>> FindAsync(FilterDefinition filterDefinition, PageRequest pageRequest)
     {
-        return await FindAsync(new List<FilterDefinition> {filterDefinition}, pageRequest);
+        return await FindAsync(new List<FilterDefinition> {}, pageRequest);
     }
 

[NoCoverage] Conditional (false) mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:84:26
     {
         List<Order> orders = pageRequest.Sort.GetOrders();
 
-        string orderBy = orders.Count == 0
-            ? $"@{Sql.KeyProperty}"
-            : orders.Select(order => $"@{order.Property} {order.Direction}").Aggregate((current, next) => $"{current}, {next}");
+        string orderBy = (false?$"@{Sql.KeyProperty}"
+:orders.Select(order => $"@{order.Property} {order.Direction}").Aggregate((current, next) => $"{current}, {next}"));
 
         string aggregate = filterDefinitions

[NoCoverage] Conditional (true) mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:84:26
     {
         List<Order> orders = pageRequest.Sort.GetOrders();
 
-        string orderBy = orders.Count == 0
-            ? $"@{Sql.KeyProperty}"
-            : orders.Select(order => $"@{order.Property} {order.Direction}").Aggregate((current, next) => $"{current}, {next}");
+        string orderBy = (true?$"@{Sql.KeyProperty}"
+:orders.Select(order => $"@{order.Property} {order.Direction}").Aggregate((current, next) => $"{current}, {next}"));
 
         string aggregate = filterDefinitions

[NoCoverage] String mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:90:43
 
         string aggregate = filterDefinitions
             .Select(filter => $"{EntityDictionary[filter.Property]} {filter.SqlOperator.Name} @{filter.Property}")
-            .Aggregate((current, next) => $"{current} AND {next}");
+            .Aggregate((current, next) => $"");
 
         List<KeyValuePair<string, object>> parameters = filterDefinitions

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:96:30
             .Select(filter => new KeyValuePair<string, object>(filter.Property, CleanParameter(filter.Value)))
             .ToList();
 
-        string whereClause = !string.IsNullOrEmpty(aggregate) ? $"WHERE {aggregate}" : "";
+        string whereClause = string.IsNullOrEmpty(aggregate) ? $"WHERE {aggregate}" : "";
 
         string query = $@"{Sql.Select} {

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:108:128
 
         IDbConnection connection = _unitOfWork.GetConnection();
         IDbTransaction transaction = _unitOfWork.GetTransaction();
-        int totalOfElements = await connection.ExecuteScalarAsync<int>(countStatement, parameters, transaction).ConfigureAwait(false);
+        int totalOfElements = await connection.ExecuteScalarAsync<int>(countStatement, parameters, transaction).ConfigureAwait(true);
         int totalPages = (int) Math.Ceiling((double) totalOfElements / size);
 

[NoCoverage] Arithmetic mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:109:45
         IDbConnection connection = _unitOfWork.GetConnection();
         IDbTransaction transaction = _unitOfWork.GetTransaction();
         int totalOfElements = await connection.ExecuteScalarAsync<int>(countStatement, parameters, transaction).ConfigureAwait(false);
-        int totalPages = (int) Math.Ceiling((double) totalOfElements / size);
+        int totalPages = (int) Math.Ceiling((double) totalOfElements * size);
 
         parameters.Add(new KeyValuePair<string, object>("Offset", page * size));

[NoCoverage] Arithmetic mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:111:67
         int totalOfElements = await connection.ExecuteScalarAsync<int>(countStatement, parameters, transaction).ConfigureAwait(false);
         int totalPages = (int) Math.Ceiling((double) totalOfElements / size);
 
-        parameters.Add(new KeyValuePair<string, object>("Offset", page * size));
+        parameters.Add(new KeyValuePair<string, object>("Offset", page / size));
         parameters.Add(new KeyValuePair<string, object>("PageSize", size));
 

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:111:9
         int totalOfElements = await connection.ExecuteScalarAsync<int>(countStatement, parameters, transaction).ConfigureAwait(false);
         int totalPages = (int) Math.Ceiling((double) totalOfElements / size);
 
-        parameters.Add(new KeyValuePair<string, object>("Offset", page * size));
+        ;
         parameters.Add(new KeyValuePair<string, object>("PageSize", size));
 

[NoCoverage] Statement mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:112:9
         int totalPages = (int) Math.Ceiling((double) totalOfElements / size);
 
         parameters.Add(new KeyValuePair<string, object>("Offset", page * size));
-        parameters.Add(new KeyValuePair<string, object>("PageSize", size));
+        ;
 
         IReadOnlyList<T> content =

[NoCoverage] String mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:112:57
         int totalPages = (int) Math.Ceiling((double) totalOfElements / size);
 
         parameters.Add(new KeyValuePair<string, object>("Offset", page * size));
-        parameters.Add(new KeyValuePair<string, object>("PageSize", size));
+        parameters.Add(new KeyValuePair<string, object>("", size));
 
         IReadOnlyList<T> content =

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:116:95
 
         IReadOnlyList<T> content =
             (
-                await connection.QueryAsync<T>(query, parameters, transaction).ConfigureAwait(false)
+                await connection.QueryAsync<T>(query, parameters, transaction).ConfigureAwait(true)
             )
             .ToList().AsReadOnly();

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:129:91
     {
         IDbConnection connection = _unitOfWork.GetWritableConnection();
         IDbTransaction transaction = _unitOfWork.GetTransaction();
-        _ = await connection.ExecuteAsync(Sql.Update, entity, transaction).ConfigureAwait(true);
+        _ = await connection.ExecuteAsync(Sql.Update, entity, transaction).ConfigureAwait(false);
 
         return (await GetByIdAsync(entity.Id)).GetValue();

[NoCoverage] Boolean mutation
Infra.PostgreSql/Commons/Repository/Repository.cs:139:101
         IDbConnection connection = _unitOfWork.GetWritableConnection();
         IDbTransaction transaction = _unitOfWork.GetTransaction();
 
-        return await connection.ExecuteAsync(Sql.Delete, new {Id = id}, transaction).ConfigureAwait(true);
+        return await connection.ExecuteAsync(Sql.Delete, new {Id = id}, transaction).ConfigureAwait(false);
     }
 }
