[NoCoverage] Object initializer mutation
Infra.PostgreSql/Domains/Mappers/TransactionMapper.cs:25:16
 
     public static TransactionEntity ToEntity(Transaction model)
     {
-        return new TransactionEntity
-        {
-            Id = model.Id,
-            Description = model.Description,
-            Amount = model.Amount,
-            Type = model.Type.Name.ToUpperInvariant(),
-            Status = model.Status.Name.ToUpperInvariant(),
-            Date = model.Date.ToUniversalTime(),
-            CreatedAt = model.CreatedAt.ToUniversalTime(),
-            UpdatedAt = model.UpdatedAt.ToUniversalTime()
-        };
+        return new TransactionEntity
+{};
     }
 }
