[NoCoverage] Boolean mutation
Infra.PostgreSql/Domains/Repositories/TransactionRepo.cs:13:41
 {
     private bool _disposed;
     
-    ~TransactionRepository() => Dispose(false);
+    ~TransactionRepository() => Dispose(true);
 
     [ExcludeFromCodeCoverage]

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Infra.PostgreSql/Domains/Repositories/TransactionRepo.cs:24:26
 
     private void Dispose(bool disposing)
     {
-        if (_disposed || !disposing) return;
+        if (_disposed || disposing) return;
         _disposed = true;
     }
