[Killed] Block removal mutation
Infra.PostgreSql/Domains/Providers/RegisterTransactionProvider.cs:18:13
     public async Task<Transaction> ExecuteAsync(Transaction transaction)
     {
         return await _unitOfWork.InvokeAsync(async () =>
-            {
-                TransactionEntity newTransactionEntity = TransactionMapper.ToEntity(transaction);
-
-                TransactionEntity transactionEntity = await _unitOfWork.Transactions.AddAsync(newTransactionEntity);
-
-                return TransactionMapper.ToModel(transactionEntity);
-            }
+            {}
         );
     }
killedBy: IntegrationTest.Infra.PostgreSql.Domains.RegisterTransactionProviderTest.SuccessfulToCreateATransaction
