[NoCoverage] Negate expression
Infra.PostgreSql/Domains/Repositories/TransactionRepository.cs:24:13
 
     private void Dispose(bool disposing)
     {
-        if (_disposed || !disposing) return;
+        if (!(_disposed || !disposing)) return;
         _disposed = true;
     }
